general_prompt = '''
Надай відповідь мовою картинки. Розпізнай весь текст на картинці та структуруй відповідь рядок за рядком. Потрібно розпізнати абсолютно весь текст: 
'''

general_prompt_copy = '''
Твоя задача - структурувати та проаналізувати зображення рахунків, знайти отримувачів і відповідні їх рахунки. 
Отримувачів може бути декілька, тому потрібо все перелічити. 
Поява тексту на зображені йде по черзі по кожному отримувачу.
Лише українська мова. 

Хочу отримати ці поля із документа в JSON:
1. Найменування отримувача
2. ЄДРПОУ
3. IBAN
4. призначення платежу
5. сумма (до сплати, разом, всього і інші позначення основної суми, в гривнях)

Виведи лише JSON, не фантазуй і не пояснюй.
'''

general_text_prompt = '''
Твоя задача - структурувати та проаналізувати розпізнаний текст рахунку, знайти отримувачів і відповідні їх рахунки. 
Розпізнаний текст подається від початку сторінки до кінця.
Отримувачів може бути декілька, тому потрібо все перелічити. 
Кожен отримувач перелічений по черзі у тексті.
Лише українська мова. 

Хочу отримати ці поля із документа в JSON:
1. Найменування отримувача
2. ЄДРПОУ
3. IBAN
4. призначення платежу
5. сума (може бути до сплати, разом, всього і інші позначення основної суми, в гривнях)

Вивід у вигляді JSON, без пояснення, тільки JSON: 
{
    Отримувач1:
        {
            Найменування_Отримувача: ...,
            ЄДРПОУ: ...,
            IBAN: ...,
            Призначення_платежу: ...,
            Сума/Разом: ... (в грн.)
        }
}

Розпізнаний текст: 
'''


basic_recognition_prompt = '''Це моя квартинка.  Прохання розпізнати весь текст на зображенні. Текст може бути різними мовами, основна мова - українська. Дай результат розпізнавання, без пояснення'''

handwritten_recognition_prompt = '''Це моя квартинка.  Прохання розпізнати рукописний текст на зображенні. Текст може бути різними мовами. Дай результат розпізнавання, без пояснення.'''

data_classification_prompt ='''Класифікуй тип документу. Доступні класи: будь-які'''

data_extraction_prompt ='''Вивантаж наступні дані у форматі JSON: 
    {
        Назва документа:
        Прізвище: 
        Імя:
        По-батькові:
    }'''

data_validation_prompt ='''Твоя задача валідувати зображення відповідно до наступних критеріїв. Відповідь у JSON форматі: 
    {
        Чи є текст? (Так або Ні)
        Чи є фотографія? (Так або Ні)
        Чи є Прізвище? (Так або Ні)
        Чи є Імя? (Так або Ні)
        Чи є Стать? (Так або Ні)
    }'''